{
    "skills" : [
        "Django / Python",
        "Golang",
        "Java",
        "Postgres",
        "Kafka",
        "AWS",
        "API Gateway",
        "Unix",
        "Git",
        "Distributed Systems",
        "Backend APIs",
        "OpenAI",
        "FIX Protocol"
    ],

    "experiences" : [
        {
            "title" : "Senior Software Engineer",
            "company" : "HeyMarvin AI (Equafin Corp)",
            "timeline" : "Nov 2024 - Jan 2026",
            "description" : [
                "Shipped & owned 30+ production features across onboarding, auth, feature flags, data retention, PII pipelines & AI-assisted workflows.",
                "Built a scalable feature-flag & plan-control system enabling tier-based access.",
                "Designed & maintained PII processing and data archival systems for surveys, audio, video & other files, including anonymization and audit metadata.",
                "Resolved high-risk production issues including auth/SSO bugs, SCIM edge cases, and zero-downtime hot-fixes.",
                "Implemented end-to-end onboarding revamp & project lifecycle management including access requests and ownership transfer."
            ]
        },
        {
            "title" : "Software Engineer 2",
            "company" : "Swiggy (Instamart / Insanely Good / SuprDaily)",
            "timeline" : "May 2022 - Oct 2024",
            "description" : [
                "Delivered multiple high-impact backend projects across SuprDaily & Insanely Good platforms.",
                "Built Realtime Demand Shaping v2 for Supr Daily storefront.",
                "Led backend changes for SuprDaily to InsanelyGood pivot, including presentation-layer services.",
                "Re-architected delivery capacity management from Hub-level to Slot/Drop-point granularity, enabling rapid scale-up delivered in 1 week.",
                "Integrated end-to-end delivery and tracking systems during migration into the Swiggy app.",
                "Tech Stack: Django (Python), Go, Java, AWS, Postgres, API Gateway."
            ]
        },
        {
            "title" : "Associate (SE 2) & Analyst (SE 1)",
            "company" : "Goldman Sachs",
            "timeline" : "Jun 2019 - May 2022",
            "description" : [
                "Built Kong API Gateway for external Advisor Portal (Asset Mgmt Tech).",
                "Re-engineered & optimized Trade Allocation workflows, scaling processing capacity by ~10x.",
                "Built high-throughput processors using Java, Kafka, DB2, QuickFIX/J."
            ]
        },
        {
            "title" : "Spring & Summer Intern",
            "company" : "Goldman Sachs",
            "timeline" : "Jun 2018 - Apr 2019",
            "description" : [
                "Built Trade/Order Position Open-Close feature. Reduced Ops Team's daily work by 1 hour & mitigated financial risk (Tech: Java, Sybase).",
                "Built an Automated Regression Tester for Derivatives Exchange Connectivity. Reduced release testing time from 8h to ~2h."
            ]
        }
    ]
}
